Documents/СоставПроизводственнойСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СоставПроизводственнойСмены</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УДАЛИТЬ_СоставПроизводственнойСмены</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бригада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеБригады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ВидПродукции</Name>
					<Comment>#14760</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКТУВПроизводственныхОперациях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособНачисленияВыработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цехи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент участия сотрудника при производстве потолка</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СотрудникиПоОперациям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Коэффициент1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПроизводственныеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник4</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыПродукции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПроизводства</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПроизводства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СпособыНачисленияВыработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыНачисленияВыработки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроизводственныеОперации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бригадная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыПроизводства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отрез</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Потолок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТиповоеПроизводство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СоставПроизводственнойСмены/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Ключ.Пустая() Тогда
		
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗаполнитьТаблицуВидовПродукции();
	
	//++ №6687 теперь способ определяется в документе
	//Если Константы.РасчетЗарплатыПроизводстваПоОперациям.Получить() Тогда
	Если Объект.СпособНачисленияВыработки = Перечисления.СпособыНачисленияВыработки.ПроизводственныеОперации Тогда
	//-- №6687
		Элементы.ГруппаСотрудникиПоОперациям.Видимость = Истина;
		Элементы.ГруппаСотрудники.Видимость = Ложь;
	Иначе
		Элементы.ГруппаСотрудникиПоОперациям.Видимость = Ложь;
		Элементы.ГруппаСотрудники.Видимость = Истина;
	КонецЕсли;
	
	Если НЕ Константы.ИспользоватьПроизводственныеБригады.Получить() Тогда
		Элементы.Бригада.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.Цех.Видимость = Константы.НесколькоТочекПроизводства.Получить();
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	// №6283 видимость колонок и расчет процента в ТЧ ИсполнителиПоОперациям
	ОбщийМодульСервер.УстановитьВидимостьКолонокВТабличнойЧастиИсполнителиПоОперациям(ЭтаФорма);
	ПересчитатьПроцентУчастияИсполнителейПоОперациям();
	ПересчитатьПроцентУчастияКТУИсполнителей();
	
	// №6687
	Если Объект.СпособНачисленияВыработки = Перечисления.СпособыНачисленияВыработки.ПроизводственныеОперации Тогда
		Элементы.ГруппаТабличныеЧасти.Заголовок = "Исполнители по операциям";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ВидыПродукции.Очистить();
	Для каждого СтрокаТЗ из ТаблицаВидыПродукции Цикл
		Если НЕ СтрокаТЗ.Пометка Тогда
			Продолжить;	
		КонецЕсли;
		НоваяСтрока = ТекущийОбъект.ВидыПродукции.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//++ №6283
	ПересчитатьПроцентУчастияИсполнителейПоОперациям();
	ПересчитатьПроцентУчастияКТУИсполнителей();
	//-- №6283
	
	ОбновитьВычисляемыеПоляВидовПродукцииСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидыПродукцииПриИзменении(Элемент)
	ОбновитьВычисляемыеПоляВидовПродукцииСервер();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВидыПродукцииПередУдалением(Элемент, Отказ)
	Отказ = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВидыПродукцииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПриИзменении(Элемент)
	
	ПересчитатьПроцентУчастияКТУИсполнителей(); // №6283
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные.Коэффициент = 0 Тогда
		ТекущиеДанные.Коэффициент = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоУчасткамПриИзменении(Элемент)
	
	ПересчитатьПроцентУчастияИсполнителейПоОперациям();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПоУчасткамСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ИсполнителиПоУчасткам.ТекущиеДанные;
	
	НомерСотрудника = Прав(Элемент.Имя, 1);
	
	Если ТекущиеДанные["Коэффициент" + НомерСотрудника] = 0 Тогда
		ТекущиеДанные["Коэффициент" + НомерСотрудника] = 1;
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВидыПродукцииУстановитьВсе(Команда)
	
	Для каждого СтрокаТЗ из ТаблицаВидыПродукции Цикл
		СтрокаТЗ.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыПродукцииСнятьВсе(Команда)
	
	Для каждого СтрокаТЗ из ТаблицаВидыПродукции Цикл
		СтрокаТЗ.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
		
	//	
	//Элемент = УсловноеОформление.Элементы.Добавить();
	//
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВидыПродукцииВидПродукции.Имя);
	//
	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВидыПродукции.ВидПроизводства");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	//ОтборЭлемента.ПравоеЗначение = Перечисления.ВидыПроизводства.Продукция;
	//
	//Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	//Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "заполнение не требуется");
	//Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	//
	////	
	//Элемент = УсловноеОформление.Элементы.Добавить();
	//
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВидыПродукцииВидПродукции.Имя);
	//
	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВидыПродукции.ВидПроизводства");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = Перечисления.ВидыПроизводства.Продукция;
	//
	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВидыПродукции.ВидПродукции");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	//
	//Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "для всех видов");
	//Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуВидовПродукции()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДокумента", Объект.ВидыПродукции.Выгрузить());
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаДокумента.ВидПроизводства КАК ВидПроизводства,
	|	ТаблицаДокумента.ВидПродукции КАК ВидПродукции
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПроизводства.Потолок) КАК ВидПроизводства,
	|	ЗНАЧЕНИЕ(Справочник.ВидыПродукции.ПустаяСсылка) КАК ВидПродукции,
	|	ПРЕДСТАВЛЕНИЕ(ЗНАЧЕНИЕ(Перечисление.ВидыПроизводства.Потолок)) КАК Представление,
	|	ЛОЖЬ КАК ПометкаУдаления,
	|	10 КАК Порядок
	|ПОМЕСТИТЬ ВТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПроизводства.Отрез),
	|	ЗНАЧЕНИЕ(Справочник.ВидыПродукции.ПустаяСсылка),
	|	ПРЕДСТАВЛЕНИЕ(ЗНАЧЕНИЕ(Перечисление.ВидыПроизводства.Отрез)),
	|	ЛОЖЬ,
	|	20
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПроизводства.ТиповоеПроизводство),
	|	ЗНАЧЕНИЕ(Справочник.ВидыПродукции.ПустаяСсылка),
	|	ПРЕДСТАВЛЕНИЕ(ЗНАЧЕНИЕ(Перечисление.ВидыПроизводства.ТиповоеПроизводство)),
	|	ЛОЖЬ,
	|	30
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПроизводства.Продукция),
	|	ВидыПродукции.Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(ВидыПродукции.Ссылка),
	|	ВидыПродукции.ПометкаУдаления,
	|	40
	|ИЗ
	|	Справочник.ВидыПродукции КАК ВидыПродукции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.ВидПроизводства КАК ВидПроизводства,
	|	ВТ.ВидПродукции КАК ВидПродукции,
	|	ВТ.Представление КАК Представление,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаДокумента.ВидПроизводства ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Пометка
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ПО (ВТ_ТаблицаДокумента.ВидПроизводства = ВТ.ВидПроизводства)
	|			И (ВТ_ТаблицаДокумента.ВидПродукции = ВТ.ВидПродукции)
	|ГДЕ
	|	(НЕ ВТ.ПометкаУдаления
	|			ИЛИ НЕ ВТ_ТаблицаДокумента.ВидПроизводства ЕСТЬ NULL)
	|	И ВЫБОР
	|			КОГДА ВТ.ВидПроизводства = ЗНАЧЕНИЕ(Перечисление.ВидыПроизводства.ТиповоеПроизводство)
	|				ТОГДА НЕ ВТ_ТаблицаДокумента.ВидПроизводства ЕСТЬ NULL
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ.Порядок,
	|	ВидПродукции
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаВидыПродукции.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьПроцентУчастияИсполнителейПоОперациям()
	
	ОбщийМодульСервер.ПересчитатьПроцентУчастияИсполнителейПоОперациям(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьПроцентУчастияКТУИсполнителей()
	
	// по аналогии с модулем зарплаты
	СуммаКоэффициентов = Объект.Сотрудники.Итог("Коэффициент");
	
	Для Каждого ТекущаяСтрока Из Объект.Сотрудники Цикл
		ТекущаяСтрока.ПроцентУчастия = ?(СуммаКоэффициентов = 0, 0, Окр(ТекущаяСтрока.Коэффициент / СуммаКоэффициентов, 4)*100);
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьВычисляемыеПоляВидовПродукцииСервер()
		
	//Для каждого СтрокаТЧ из Объект.ВидыПродукции Цикл
	//	ПродукцияНеуникальная	
	//КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
